# asdf Erlang dependencies
brew "autoconf"
brew "openssl@1.1"
brew "wxwidgets"
brew "libxslt"
brew "fop"

# asdf NodeJS dependencies
brew "coreutils"
brew "gpg"

# Vim dependencies
brew "neovim", args: ["HEAD"]
brew "tree-sitter", args: ["HEAD"]
brew "luajit", args: ["HEAD"]
brew "the_silver_searcher"

# Miscellaneous goodies
brew "bat"
brew "glow"
brew "fish"
brew "peco"
brew "pillow"

# Casks
cask "hammerspoon"
cask "kitty"
