# asdf Erlang dependencies
brew "openssl"
brew "autoconf"
brew "wxmac"

# asdf NodeJS dependencies
brew "coreutils"
brew "gpg"

# Vim dependencies
brew "vim"
brew "tree-sitter", args: ["HEAD"]
brew "luajit", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "the_silver_searcher"

# Miscellaneous goodies
brew "bat"
brew "glow"
brew "fish"
brew "peco"

# Casks
cask "hammerspoon"
cask "kitty"
